import os
from dotenv import load_dotenv

# تحميل المتغيرات من ملف .env إذا كان موجوداً (مفيد للتشغيل المحلي)
load_dotenv()

# ---------------------------------------------------------
# 1. بيانات الحساب الأساسية (التليجرام)
# ---------------------------------------------------------
API_ID = int(os.getenv("API_ID", "24803565"))
API_HASH = os.getenv("API_HASH", "67017684693998f8045f8f9037c80523")
BOT_TOKEN = os.getenv("BOT_TOKEN", "8584176399:AAFXwo50vkJd802-dWBdIJeyPOr_2p3cCdw")

# كود الجلسة للحساب المساعد (ضروري لفتح المايك)
STRING_SESSION = os.getenv("STRING_SESSION", "") 

# ---------------------------------------------------------
# 2. قاعدة البيانات (MongoDB)
# ---------------------------------------------------------
# ملاحظة: تأكد من استبدال <db_username> و <db_password> ببياناتك الحقيقية
MONGO_DB_URI = "mongodb+srv://skonbrahim6:YOUR_PASSWORD@cluster0.v4a00kd.mongodb.net/?appName=Cluster0"

# ---------------------------------------------------------
# 3. هوية المطور والبوت
# ---------------------------------------------------------
OWNER_ID = 7445763567 
SUPPORT_USER = "C_R_B_X"
BOT_USERNAME = "spoti_music_bot"
BOT_NAME = "𝐒𝐏𝐎𝐓𝐈 𝐌𝐔𝐒𝐈𝐂 🎶"

# ---------------------------------------------------------
# 4. الميديا والروابط الخارجية
# ---------------------------------------------------------
# فيديو رسالة الـ Start الفخمة
START_VIDEO = "https://l.top4top.io/m_36723i2xy0.mp4"

# روابط القنوات والدعم
SUPPORT_GROUP = "https://t.me/C_R_B_X"
SOURCE_CHANNEL = "https://t.me/C_R_B_X"

# ---------------------------------------------------------
# 5. إعدادات فنية إضافية
# ---------------------------------------------------------
# مدة انتظار التحميل (بالثواني)
DURATION_LIMIT = 600 # 10 دقائق كحد أقصى للأغنية الواحدة
